backend/app/controllers/api/v1/pokemons_controller.rb

    def index
        pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

    def create
            pokemon = Pokemon.create(pokemons_params)
                if pokemon.save
---
INSERT INTO "pokemons" ("name", "pokemon_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pikachu"], ["pokemon_type", "Electric"], ["created_at", "2021-04-27 02:18:37.179622"], ["updated_at", "2021-04-27 02:18:37.179622"]]
INSERT INTO "pokemons" ("name", "pokemon_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pikachu"], ["pokemon_type", "Electric"], ["created_at", "2021-04-26 00:53:22.431945"], ["updated_at", "2021-04-26 00:53:22.431945"]]

    def destroy
        pokemon = Pokemon.find_by(id: params[:id])
        pokemon.destroy
        all_pokemon = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 11]]
SELECT "pokemons".* FROM "pokemons" WHERE (10) LIMIT ?  [["LIMIT", 1]]